type Term = {
  title: string
  content: string
}[]

export const PRIVACY_TERM: Term = [
  {
    title: '제1조(목적)',
    content: `팀 BROOM이 운영하는 broom.life(이하 “broom”라 한다)에서 제공하는 서비스를 이용하는 개인의 정보를 보호하기 위해, 개인정보보호법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률(이하 '정보통신망법') 등 관련 법령을 준수하고, 서비스 이용자의 개인정보 보호 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보처리방침을 수립합니다. 본 개인정보 처리방침에서 정하지 않은 용어의 정의는 서비스 이용약관을 따릅니다.`,
  },
  {
    title: '제2조(수집하는 개인정보의 항목)',
    content: `"broom"은 서비스 제공을 위해 다음 항목 중 최소한의 개인정보를 수집합니다.

1. 회원가입 시 수집되는 개인정보
- 아이디, 비밀번호, 닉네임, 전역 연도, 복무 군종
2. 버스 신청 시 별도로 수집되는 개인정보
- 이름, 학번, 연락처
3. 문의를 할 경우
- 서비스 이용 문의 : 이메일, 기기정보, 문의내용에 포함된 개인정보

※ 각 항목 또는 추가적으로 수집이 필요한 개인정보 및 개인정보를 포함한 자료는 이용자 응대 과정과 서비스 내부 알림 수단 등을 통해 별도의 동의 절차를 거쳐 요청, 수집될 수 있습니다.

※ 서비스 이용 과정에서 기기 정보(유저 에이전트), 이용 기록(회원 간 주고받은 채팅의 내용 및 첨부파일, 서비스 부정 이용 기록), 로그 기록(IP 주소, 접속 시간)이 자동으로 수집될 수 있습니다.

※ 서비스 이용 과정에서 자동으로 수집된 정보는 다른 정보와의 결합 여부, 처리 방식 등에 따라 개인정보에 해당하거나 해당하지 않을 수 있으며 "broom"은 이를 서비스 제공 목적으로 처리할 수 있습니다.`,
  },
  {
    title: '제3조(개인정보 처리의 원칙)',
    content:
      '개인정보 관련 법령 및 본 방침에 따라 "broom"은 이용자의 개인정보를 수집할 수 있으며 수집된 개인정보는 개인의 동의가 있는 경우에 한해 제3자에게 제공될 수 있습니다. 단, 법령의 규정 등에 의해 적법하게 강제되는 경우 "broom"은 수집한 이용자의 개인정보를 사전에 개인의 동의 없이 제3자에게 제공할 수도 있습니다.',
  },
  {
    title: '제4조(본 방침의 변경)',
    content: `1. 본 방침은 개인정보 관련 법령, 지침, 고시 또는 정부나 "broom" 서비스의 정책이나 내용의 변경에 따라 개정될 수 있습니다.
2. "broom"은 제1항에 따라 본 방침을 개정하는 경우 다음 각 호 하나 이상의 방법으로 공지합니다.
- "broom"이 운영하는 인터넷 홈페이지의 첫 화면의 공지사항란 또는 별도의 창을 통하여 공지하는 방법
- 서면·모사전송·전자우편 또는 이와 비슷한 방법으로 이용자에게 공지하는 방법
3. "broom"은 제2항의 공지를 본 방침 개정의 시행일로부터 최소 7일 이전에 공지합니다. 다만, 이용자 권리의 중요한 변경이 있을 경우에는 최소 30일 전에 공지합니다.`,
  },
  {
    title: '제5조(개인정보의 처리 및 보유 기간)',
    content: `"broom"은 법령에 따른 개인정보 보유 및 이용기간 또는 회원으로부터 개인정보를 수집 시에 동의 받은 개인정보의 보유 및 이용기간 내에서 개인정보를 처리 및 보유합니다.

각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.

1. BROOM 회원 식별 및 관리 : 회원 탈퇴 후 14일 까지
2. 학생 예비군 버스 대절 사업 신청 : 30일
3. 서비스 이용 문의 : 3년
4. 게시물 신고를 통해 수집된 개인정보 및 신고 내용 : 3년
- 단, 본인 확인 용도의 개인정보는 본인 확인 후 즉시 파기합니다.
    
5. 로그 기록 : 1년
6. 기기 정보 : 1년
7. 비식별화 된 개인정보

※ 비식별화란? 일방향 암호화 처리를 통해 개인정보를 익명 처리하는 과정을 말합니다. 비식별화된 정보는 복호화가 불가능하며, "broom"을 포함하여 누구라도 이 정보로 개인을 식별하거나 유추할 수 없습니다.`,
  },
  {
    title: '제6조(개인정보의 제3자 제공)',
    content: `"broom"은 개인정보 제3자 제공 금지에도 불구하고, 이용자가 사전에 공개하거나 다음 각호 사항에 대하여 동의한 경우에는 제3자에게 개인정보를 제공할 수 있습니다. 다만 이 경우에도 "broom"은 관련 법령 내에서 최소한으로 개인정보를 제공합니다.

1. 제공받는 자 : 광운대학교 총학생회(비상대책위원회)
2. 이용 목적 : 원활한 버스 대절 사업 진행 / 당첨자 식별
3. 개인정보 항목
    - 이름, 학번, 연락처

※ 재난, 감염병, 급박한 신체 위험을 초래하는 사건 및 사고, 급박한 재산 손실 등의 긴급상황이 발생하는 경우 회원의 동의 없이 관계기간에 개인정보를 제공할 수 있습니다.`,
  },
  {
    title: '제7조(개인정보의 파기)',
    content: `1. "broom"은 원칙적으로 이용자의 개인정보 처리 목적의 달성, 보유·이용기간의 경과 등 개인정보가 필요하지 않을 경우에는 해당 정보를 지체 없이 파기합니다.
2. "broom"은 위와 같이 파기 사유가 발생한 개인정보는 지체없이 재생이 불가능한 방법으로 파기합니다. 전자적 파일 형태로 기록,저장된 개인정보는 기록을 재생할 수 없도록 파기하며, 종이 문서에 기록,저장된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.`,
  },
  {
    title: '제8조(정보주체의 권리, 의무 및 행사)',
    content: `1. 회원은 언제든지 서비스 내부 [내 정보]에서 자신의 개인정보를 조회하거나 수정, 삭제, 탈퇴 할 수 있으며, [문의하기]를 통해 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다. 이에 대해 "broom"은 지체없이 조치하겠습니다.
2. 회원의 개인정보 열람·정정·삭제·처리정지 요구는 법률에 특별한 규정이 있는 등의 경우에는 "broom"이 거절할 수 있습니다. 
3. "broom"은 회원의 정보주체 권리에 따른 열람·정정·삭제·처리정지 요구 시, 요구를 한 이용자가 본인이거나 정당한 법정대리인인지 확인합니다.`,
  },
  {
    title: '제9조(개인정보 자동 수집 장치의 설치·운영 및 거부에 관한 사항)',
    content: `1. "broom"은 이용자에게 개별적인 맞춤서비스를 제공하기 위해 이용 정보를 저장하고 수시로 불러오는 개인정보 자동 수집장치(이하 '쿠키')를 사용합니다. 쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 웹브라우저(PC 및 모바일을 포함)에게 보내는 소량의 정보이며 이용자의 저장공간에 저장되기도 합니다.
2. 이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서 이용자는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다.
3. 다만, 쿠키의 저장을 거부할 경우에는 로그인이 필요한 "broom"의 일부 서비스는 이용에 어려움이 있을 수 있습니다.`,
  },
  {
    title: '쿠키 설정 거부 방법 예시',
    content: `웹브라우저
1. Edge : 웹브라우저 우측 상단의 설정 메뉴 > 쿠키 및 사이트 권한 > 쿠키 및 사이트 데이터 관리 및 삭제
2. Chrome : 웹브라우저 우측 상단의 설정 메뉴 > 개인정보 및 보안 > 쿠키 및 기타 사이트 데이터
3. Whale : 웹브라우저 우측 상단의 설정 메뉴 > 개인정보 보호 > 쿠키 및 기타 사이트 데이터`,
  },
]

export const SERVICE_TERM: Term = [
  {
    title: '제 1조(목적)',
    content: `이 약관은 팀 BROOM이 운영하는 broom.life(이하 “broom”라 한다)에서 제공하는 서비스를 이용함에 있어 "broom"과 이용자의 권리•의무 및 책임사항을 규정함을 목적으로 합니다. 서비스에 접속하거나 이용함으로써, 이용자가 본 이용약관을 읽었고 이해하였으며 적용 받는 것에 동의하게 됩니다.`,
  },
  {
    title: '제 2조(정의)',
    content: `1. 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
- "서비스"란, BROOM이 제공하는 모든 서비스 및 기능을 의미합니다.
- "이용자"란, 이 약관에 따라 서비스를 이용하는 회원 및 비회원을 말합니다.
- "회원"이란, 서비스에 회원등록을 하고 서비스를 이용하는 자를 말합니다.
- "비회원"이란, 서비스에 회원등록을 하지 않고 서비스를 이용하는 자를 말합니다.
- "게시물"이란 ,회원이 서비스 내에서 게시하는 모든 형태의 정보(텍스트, 이미지, 링크 등)를 의미합니다.
- "커뮤니티"란, 게시물을 게시할 수 있는 공간을 말합니다.
- "로그 기록"이란, 이용자가 서비스를 이용하면서 자동으로 생성된 IP주소, - 속 시간 등을 말합니다.
- "계정"이란, 이용계약을 통해 생성된 회원의 고유 아이디와 이에 수반하는 정보를 말합니다.
- "연락처"란, 회원가입 등을 통해 수집된 이용자의 이메일, 휴대전화 번호 등을 의미합니다.
- "관련법"이란, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 전기통신사업법, 개인정보보호법 등 관련 있는 국내 법령을 말합니다.
2. 제 1항에서 정의되지 않은 이 약관 내 용어의 의미는 일반적인 이용관행에 의합니다.`,
  },
  {
    title: '제 3조(약관 등의 명시와 설명 및 개정)',
    content: `1. "broom"는 본 약관을 초기 화면 또는 연결 화면을 통해 게시하거나 기타의 방법으로 이용자에게 공지합니다.
2. 본 약관은 관련 법령을 위반하지 않는 범위에서 개정될 수 있으며, 개정약관 적용  7일 전부터 "공지사항"을 통해 공지합니다.
3. 이용자가 개정된 약관에 동의하지 않는 경우, 서비스 이용을 중단하고 회원 탈퇴를 통한 거부 의사를 표시할 수 있습니다. 단, "broom"이 약관 개정 시 "개정 약관의 적용 일자까지 회원이 거부 의사를 표시하지 아니할 경우 약관의 개정에 동의한 것으로 간주한다"는 내용을 고지하였음에도 불구하고 회원이 약관 개정에 대한 거부 의사를 표시하지 아니하면, "broom"은 적용 일자부로 개정 약관에 동의한 것으로 간주합니다.
4. 이용자는 약관 일부분만을 동의 또는 거부할 수 없습니다.
5. "broom"은 제 1항부터 제 3항까지를 준수하였음에도 불구하고 회원이 약관 개정 사실을 알지 못함으로써 발생한 피해에 대해 "broom"의 고의 또는 중대한 과실이 없는 한 어떠한 책임도 지지 않습니다.`,
  },
  {
    title: '제 4조(서비스의 제공)',
    content: `1. "broom"은 이용자에게 다음과 같은 서비스를 제공합니다.
- 승차 공유를 위한 커뮤니티 서비스
- 총학생회 버스 대절 사업과 연계된 버스 신청 서비스
- 학생 예비군과 관련된 정보 재공 서비스
2. 서비스 내에서 주고받은 메시지 등 회원이 전송한 콘텐츠는 서버를 경유하면서 저장·보관될 수 있으며 이 정보는 "broom"만이 보유합니다. "broom"은 관련 법령 및 이 약관과 개인정보처리방침에 따라 정보를 처리합니다.
3. "broom"은 운영상, 기술상의 필요에 따라 제공하고 있는 서비스를 변경할 수 있습니다.
4. "broom"은 이용자의 개인정보 및 서비스 이용 기록에 따라 서비스 이용에 차이를 둘 수 있습니다.
5. "broom"은 설비의 보수, 교체, 점검 또는 기간수선이나 서비스 중지, 인터넷 장애 등의 사유로 인해 일시적으로 서비스 제공이 어려울 경우, 통보 없이 일시적으로 서비스 제공을 중단할 수 있습니다.
6. "broom"은 천재지변, 전쟁, 경영 악화 등 불가항력적인 사유로 인해 서비스를 더 이상 제공하기 어려울 경우, 통보 없이 서비스 제공을 영구적으로 중단할 수 있습니다.
7. "broom"은 제8항부터 제10항까지 또는 다음 내용으로 인해 발생한 피해에 대해 "broom"의 고의 또는 중대한 과실이 없는 한 어떠한 책임도 지지 않습니다.
- 모든 서비스, 게시물, 이용 기록의 진본성, 무결성, 신뢰성, 이용가능성의 보장
- 서비스 이용 중 타인과 상호 간에 합의한 사항
- 게시물, 광고의 버튼, 하이퍼링크 등 외부로 연결된 서비스와 같이 "broom"이 제공하지 않은 서비스에서 발생한 피해
- "broom"이 관련 법령에 따라 요구되는 보호조치를 이행하였음에도 불구하고, 네트워크의 안정성을 해치는 행위 또는 악성 프로그램 등에 의하여 발생하는 예기치 못한 이용자의 피해
- 이용자의 귀책 사유 또는 "broom"의 귀책 사유가 아닌 사유로 발생한 이용자의 피해
`,
  },
  {
    title: '제 5조(서비스 이용계약의 성립)',
    content: `1. "broom"과 회원의 서비스 이용계약은 서비스를 이용하고자 하는 자(이하 "가입 신청자"라고 합니다)가 서비스 내부의 회원가입 양식에 따라 필요한 회원정보를 기입하고, 이  약관, 개인정보 수집 및 이용 동의 등에 명시적인 동의를 한 후, 신청한 회원가입 의사 표시(이하 "이용신청"이라 합니다)를 "broom"이 승낙함으로써 체결됩니다.
2. 제 1항의 승낙은 신청순서에 따라 순차적으로 처리되며, 회원가입의 성립 시기는 "broom"의 회원가입이 완료되었음을 알리는 승낙의 통지가 회원에게 도달하거나, 이에 준하는 권한이 회원에게 부여되는 시점으로 합니다.
3. "broom"은 가입 신청자의 이용신청에 있어 다음 각 호에 해당하는 경우, 이용신청을 영구적으로 승낙하지 않거나 유보할 수 있습니다.
- "broom"이 정한 이용신청 요건에 충족되지 않을 경우
- 제 10조(금지행위)에 해당하는 행위를 하거나 해당하는 행위를 했던 이력이 있을 경우
- 기술 및 설비 상 서비스를 제공할 수 없는 경우
- 기타 합리적인 판단에 의하여 필요하다고 인정하는 경우
4. "broom"은 제3항으로 인해 발생한 피해에 대해 "broom"의 고의 또는 중대한 과실이 없는 한 어떠한 책임도 지지 않습니다.`,
  },
  {
    title: '제 6조(개인정보의 관리 및 보호)',
    content: `1. "broom"은 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 이용에 관해서는 관련 법령 및 "broom"의 개인정보처리방침을 따릅니다.
2. 회원은 개인정보에 변동이 있을 경우, 즉시 "내 정보" 메뉴 및 문의 창구를 이용하여 정보를 최신화해야 합니다.
3. 회원의 아이디, 비밀번호, 이메일, 연락처 등 모든 개인정보의 관리책임은 본인에게 있으며, 타인에게 양도 및 대여할 수 없으며 안전하게 보관해야 합니다. 만약 본인의 아이디 및 비밀번호를 타인이 사용하고 있음을 인지했을 경우, 즉시 문의 창구로 알려야 하고, 안내가 있는 경우 이에 따라야 합니다.
4. "broom"은 회원이 제공한 제3항을 이행하지 않아 발생한 피해에 대해, "broom"의 고의 또는 중대한 과실이 없는 한 어떠한 책임도 지지 않습니다.`,
  },
  {
    title: '제 7조(서비스 이용계약의 종료)',
    content: `1. 회원은 언제든지 본인의 계정으로 로그인한 뒤 서비스 내부의 "탈퇴하기" 버튼을 누르는 방법으로 탈퇴를 요청할 수 있으며, 그 외 문의 창구 등을 통한 탈퇴 요청은 처리되지 않습니다. "broom"은 해당 요청을 확인한 후 탈퇴를 처리합니다.
2. 탈퇴 처리가 완료되더라도, 회원이 게시한 게시물은 삭제되지 않습니다.
3. "broom"은 회원이 제10조(금지행위)에 해당하는 행위를 하거나 해당하는 행위를 했던 이력이 있을 경우, 제11조(서비스 제공의 중단 및 서비스 이용계약의 해제)에 따라 서비스 제공을 중단하거나 서비스 이용계약을 해지할 수 있습니다.
4. "broom"은 제1항부터 제3항까지로 인해 발생한 피해에 대해 "broom"의 고의 또는 중대한 과실이 없는 한 어떠한 책임도 지지 않습니다.`,
  },
  {
    title: '제 8조(회원에 대한 통지)',
    content: `1. "broom"이 회원에 대한 통지가 필요한 경우, 이용자의 연락처 또는 서비스 내부 알림 수단을 이용할 수 있습니다.
2. "broom"은 이용자 전체에 대한 통지를 하는 경우 공지사항에 게시함으로써 전 항의 통지에 갈음할 수 있습니다. 단, 이용자의 권리·의무에 중대한 영향을 미치는 사항에 대해서는 개별 통지를 합니다.
3. "broom"이 이용자에게 "30일 이내에 의사를 표명하지 아니할 경우 동의한 것으로 간주한다"는 내용을 고지하였음에도 불구하고 회원이 의사를 표시하지 아니하면, "broom"은 통지 내용에 동의한 것으로 간주합니다.`,
  },
  {
    title: '제 9조(게시물의 삭제 및 접근 차단)',
    content: `1. 누구든지 게시물로 인해 사생활 침해나 명예훼손 등 권리가 침해된 경우 "broom"에 해당 게시물의 삭제 또는 반박내용의 게재를 요청할 수 있습니다. 이 때 "broom"은 해당 게시물을 삭제할 수 있으며, 만약 권리 침해 여부가 불분명하거나 당사자 간 다툼이 예상될 경우에는 해당 게시물에 대한 접근을 30일간 임시적으로 차단하는 조치를 취할 수 있습니다.
2. "broom"이 제1항에 따라 회원의 게시물을 삭제하거나 접근을 임시적으로 차단하는 경우, 해당 게시물이 작성된 커뮤니티에 필요한 조치를 한 사실을 명시하고, 불가능한 사유가 없을 경우 이를 요청한 자와 해당 게시물을 작성한 회원에게 그 사실을 통지합니다.`,
  },
  {
    title: '제 10조(금지행위)',
    content: `1. 이용자는 다음과 같은 행위를 해서는 안 되며, 위반 시 서비스 이용이 제한될 수 있습니다.
- 개인정보 또는 계정 기만, 침해, 공유 행위
- 시스템 부정행위
- 업무 방해 행위
- 불법적이거나 부적절한 콘텐츠 게시
- 서비스 운영을 방해하는 행위
- 성적 도의관념에 반하는 행위
- 홍보/판매 행위
- 기타 관련 법령 및 공공질서에 반하는 행위
2. 이용자가 제1항에 해당하는 행위를 할 경우, "broom"은 이 약관 제11조(서비스 제공의 중단 및 서비스 이용약관의 해지)에 따라 서비스 제공을 중단하거나 서비스 이용계약을 해지할 수 있습니다.`,
  },
  {
    title: '제 11조(서비스 제공의 중단 및 서비스 이용계약의 해지)',
    content: `1. 이용자가 이 약관에서 명시된 금지행위 및 이에 준하는 행위를 할 경우, "broom"은 서비스 보호를 위해 다음과 같은 조치를 최대 영구적으로 취할 수 있습니다. 해당 조치는 서비스 보호를 위해 불가피하다고 판단될 경우, 제공하는 모든 서비스의 동일인으로 확인되는 모든 계정에 일괄적으로 적용될 수 있습니다.
- 이용자의 서비스 이용 권한, 자격, 혜택 제한 및 회수
- 회원과 체결된 이용계약의 해지
- 회원가입 거부
- 회원의 커뮤니티, 게시물, 닉네임, 프로필 사진, 이용 기록을 삭제, 중단, 수정, 변경
- 그 외 "broom"의 정상적인 운영을 위해 서비스가 필요하다고 판단되는 조치
2. "broom"은 서비스 제공 중단 및 서비스 이용계약 해지 시, 회원의 연락처 또는 서비스 내부 알림 수단을 통하여 그 사실을 사유와 함께 개별 통지합니다. 회원은 해당 통지를 받은 날로부터 7일 이내에 문의 창구로 이의를 제기할 수 있습니다.
3. "broom"은 이용자의 귀책 사유로 인한 서비스 제공 중단 및 서비스 이용계약의 해지로 인해 발생한 피해에 대해 "broom"의 고의 또는 중대한 과실이 없는 한 어떠한 책임도 지지 않습니다.`,
  },
  {
    title: '제 12조(재판권 및 준거법)',
    content: `1. "broom"과 이용자 간에 발생한 분쟁에 관한 소송은 민사소송법상의 관할 법원에 제소합니다.
2. "broom"과 이용자 간에 제기된 소송에는 대한민국 법을 준거법으로 합니다.`,
  },
  {
    title: '제 13조(기타)',
    content: `1. 이 약관은 2025년 2월 28일에 개정되었습니다.
2. 이 약관에도 불구하고, "broom"과 이용자가 이 약관의 내용과 다르게 합의한 사항이 있느 경우에는 해당 내용을 우선으로 합니다.
3. "broom"이 필요한 경우 약관의 하위 규정을 정할 수 있으며, 이 약관과 하위 규정이 상충하는 경우에는 이 약관의 내용이 우선 적용됩니다.
4. 이 약관에서 정하지 아니한 사항과 약관의 해석에 관하여는 관련법 또는 관례에 따릅니다.`,
  },
]
